{
  "timestamp": "2025-06-24T13:22:33.271415",
  "total_posts": 96,
  "subreddit_breakdown": {
    "reddit_r_bangladesh": 15,
    "reddit_r_Dhaka": 15,
    "reddit_r_Chittagong": 15,
    "reddit_r_sylhet": 15,
    "reddit_r_BangladeshPolitics": 15,
    "reddit_r_BUET": 6,
    "reddit_r_NSU": 15
  },
  "all_posts": [
    {
      "source": "reddit_r_bangladesh",
      "title": "Weekly Thread on Controversial Topics (read the post before you start commenting!)",
      "content": "Ok folks, here it is - the weekly outlet to vent your hottest, controversial takes. But first, please follow the rules -\n\n1. Create one comment thread for each topic.\n2. Only replies to parent/original comment are allowed for that particular thread.\n3. Do not reply to original post to comment on already existing thread.\n4. Subreddit rules still apply, especially rules #1 and #2.",
      "url": "https://www.reddit.com/r/bangladesh/comments/1li71w1/weekly_thread_on_controversial_topics_read_the/",
      "score": 8,
      "comments_count": 0,
      "created_utc": 1750651279.0,
      "author": "AutoModerator",
      "flair": "Discussion/আলোচনা",
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_bangladesh",
      "title": "Which game would you get on Steam if you had the money?",
      "content": "Well, I finally got myself all the games I wanted on Steam,   \nSo, with steam sale coming up, I'm planning on getting Helldivers 2 and foxhole.\n\nAnd then I wonder, which games would y'all get?",
      "url": "https://www.reddit.com/r/bangladesh/comments/1lj3vll/which_game_would_you_get_on_steam_if_you_had_the/",
      "score": 3,
      "comments_count": 6,
      "created_utc": 1750746556.0,
      "author": "EmperorOfEveryEmpire",
      "flair": "Discussion/আলোচনা",
      "comments": [
        "Kof 15, street fight 6, persona 3 reload, stellar blade, baldur's game 3, blood borne, some final fantasy games.",
        "Expedition 33",
        "Left for dead 2"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_bangladesh",
      "title": "Joker saw BD and said - \"Is it just me, or is it getting crazier out there?\"",
      "content": "",
      "url": "https://www.reddit.com/r/bangladesh/comments/1liimip/joker_saw_bd_and_said_is_it_just_me_or_is_it/",
      "score": 41,
      "comments_count": 6,
      "created_utc": 1750690306.0,
      "author": "maifee",
      "flair": "Environment/পরিবেশ",
      "comments": [
        "What do you even expect from the people and the system? This country is living hell. It's filled with potential rapists, misogynists, extremists and biggots. I wish a disaster wipes out these diseases.",
        "Current Bimpi is no different than kuttaleague",
        "Well nothing much to expect. \nShe's only gonna get shamed for being raped and be victim blamed. Trash of the country would rather love to insult her and her ethics then insulting the rapist."
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_bangladesh",
      "title": "Felt like I failed to protect my SO",
      "content": "Something happened yesterday night that’s been weighing heavily on me.\n\nMy girlfriend and I were out together. I stepped away briefly to grab some tea from a nearby tong, while she waited on the sidewalk. When I came back, I found her visibly agitated and upset. She told me that while I was gone, a group of three older men (probably in their 50s or so) were staring at her, checking her out, and making vulgar comments.\n\nHearing this, I walked over to them to confront the situation, to ask what was was going on. But before I could even get a word in, my girlfriend, clearly fired up and emotional, started reacting loudly to them. It escalated quickly, so I pulled her away from there to calm her down and avoid things getting worse.\n\nLater, she broke down crying and asked me why I didn’t confront them more directly or do more to defend her in the moment. I honestly didn’t know what to say — I felt completely helpless. I couldn’t even begin to imagine how vulnerable she must’ve felt in that moment. All I wanted was to keep her safe and get her away from the situation, but now I’m left feeling like I failed in my basic duty to protect the person I care most about.I couldn’t sleep last night, replaying everything in my head.\n\nI just wanted to get that off my chest and ask you all for suggestions on what could I have done differently, and how should I handle this situation in future?",
      "url": "https://www.reddit.com/r/bangladesh/comments/1li9rah/felt_like_i_failed_to_protect_my_so/",
      "score": 95,
      "comments_count": 45,
      "created_utc": 1750661217.0,
      "author": "jignesspesto",
      "flair": "Discussion/আলোচনা",
      "comments": [
        "A fight evaded is a fight won",
        "Life is no bangla cinema. You did the right thing. Streets aren't safe anymore, they could have easily attacked you, or worse, create a mob for doing \"haram relation\" or smthng\n\nYour gf should be more considerate",
        "Ignore u/donttouchthebuttnemo’s take. It wasn't your fault, and definitely wasn’t your girlfriend’s fault either. The people who harassed her are the only ones to blame here.\n\nYour girlfriend freaked out because she had just been harassed. It was her natural response to feeling unsafe and vulnerable, and honestly, people who harass women on the street deserve to be called out. Later she reacted strongly only because she knew you had her back, which you surely did. You calmed the situation down and got her away from a dangerous situation, given how quickly mob drama can ignite when a woman is involved. \n\nShe might’ve said you didn’t do enough because she was hurt and overwhelmed at thar moment, buut i can assure you that once she cools off, she’ll see you were doing your best to protect her. Give her a bit of time and space, things will get better. \n\nEdit: clarity"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_bangladesh",
      "title": "Am I the only grown man who is scared of house lizards (Tiktiki)?",
      "content": "I’m 32, and still terrified of house lizards (tiktiki). Today, I saw one on my motorbike before heading to the gym. I ignored it, thinking “I’m a man now.”\n\nMid-ride, the lizard crawled onto my hand. I freaked out, nearly lost control trying to flick it off. Didn’t crash, but the moment’s stuck in my head. Still feel like it’s on me.\n\nAnyone else like this? How do you deal with this kind of fear? I can hold a cockroach but tiktiki be the most disgusting thing to me. I cant be the only one 🥲",
      "url": "https://www.reddit.com/r/bangladesh/comments/1lijjbi/am_i_the_only_grown_man_who_is_scared_of_house/",
      "score": 15,
      "comments_count": 24,
      "created_utc": 1750692400.0,
      "author": "GlumSlide4001",
      "flair": "AskDesh/দেশ কে জিজ্ঞাসা",
      "comments": [
        "I am okay with Tiktiki. Shit my pants if I see a cockroach. 😖 I am 40! 🙈",
        "I am 35. I am terrified of Tiktiki. I refuse to even walk or stay in a room with it.",
        "32 m here. Scared of tiktiki"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_bangladesh",
      "title": "যুক্তরাষ্ট্রের ঘাঁটিগুলোতে ইরানের ক্ষেপণাস্ত্র হামলায় কোনো হতাহতের ঘটনা ঘটেনি।",
      "content": "\n-ফক্স নিউজ",
      "url": "https://www.reddit.com/r/bangladesh/comments/1linjru/যকতরষটরর_ঘটগলত_ইরনর_কষপণসতর_হমলয়_কন_হতহতর_ঘটন_ঘটন/",
      "score": 7,
      "comments_count": 4,
      "created_utc": 1750701471.0,
      "author": "rhatguy75",
      "flair": "Discussion/আলোচনা",
      "comments": [
        "মার্কিন সন্ত্রাসীদের ইরান আগে থেকে নোটিশ দিয়ে রাখছিল, তাই তেমন কেউ নিহত হয় নাই।\n\n(অন্তত ইজরাইল/আমেরিকার মতো নির্দোষ শিশুদের হত্যা না করে, ভ্যালিড মিলিটারি বেস টার্গেট করছে তারা)",
        "Iran on the way to Iraq situation.",
        "Iran military on X , they said it was a coordinated attack with Qatar to minimize the loss"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_bangladesh",
      "title": "(For people that use DOT Internet) Is the 40 mbps pack referring to megaBIT per second or megaBYTE per second? (meaning is this 5 megabytes for 890?)",
      "content": "",
      "url": "https://www.reddit.com/r/bangladesh/comments/1likukb/for_people_that_use_dot_internet_is_the_40_mbps/",
      "score": 5,
      "comments_count": 6,
      "created_utc": 1750695378.0,
      "author": "Arcweeb7",
      "flair": "Science & Technology/বিজ্ঞান ও প্রযুক্তি",
      "comments": [
        "Please provide a source for the image.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/bangladesh) if you have any questions or concerns.*",
        "Remember, small 'b' always refers to bits."
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_bangladesh",
      "title": "NYC mayoral candidate Zohran Mamdani makes video in fluent Bangla! Not sure if anyone is following this election, but Bangladeshi-Americans are turning out for him in big numbers",
      "content": "",
      "url": "https://www.reddit.com/r/bangladesh/comments/1li1pno/nyc_mayoral_candidate_zohran_mamdani_makes_video/",
      "score": 87,
      "comments_count": 35,
      "created_utc": 1750634645.0,
      "author": "Atel_mamu",
      "flair": "Politics/রাজনীতি",
      "comments": [
        "I am rooting for him. I hope he wins against the old hack Cuomo!",
        "I am and I ranked him!!",
        "He is the son of Meera Nair, who is an India. Filmmaker. Shouldn't be hard for him to speak Bangla."
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_bangladesh",
      "title": "Career guide",
      "content": "Hey guys, we are hosting a free webinar this Tuesday for EM students, based on what to do after IALs, scholarships, going abroad, or staying in country and how to apply and prep for public or private universities, as well as how to choose your career path.\n\nMe and Atique Chowdhury are both at DU and Munshi Lazimuzzaman is studying at Australia on a full scholarship, and we hope, as seniors, to answer some common questions and issues for you guys.\n\nhttps://m.me/j/AbZqsE3jMOfHX6pu/\n\nWebinar group link",
      "url": "https://www.reddit.com/r/bangladesh/comments/1liq95m/career_guide/",
      "score": 2,
      "comments_count": 0,
      "created_utc": 1750707642.0,
      "author": "soul_ofdarkandlight",
      "flair": "Education/শিক্ষা",
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_bangladesh",
      "title": "I just had a thought when I saw a news about the education system.",
      "content": "So, I am in ssc batch 27 (class 9) and, while watching the somoi TV news from a few days ago I saw that, they are trying to implement another new education system for Bangladesh starting 2027. I just had a thought while watching the news, couldn't they just modify some things with the new curriculum? Like, I remember how the the ICT book was really good there. Now, the the book seems to me  that it's 10 to 12 years behind. So, couldn't we do something like where, ever subject has some class work and, everything you do in class is counted on your marks? If we did something like that, because, then people would have pressure to study all year. Plus you have examination life half monthly and finals. So, people would study. And learn all the time. With books that are updated every 3 years or so. And, even if the gov doesn't do something like this, they should do it not within two years. I think, they should give them selves minimum of 5 years. Us class 10 and 9 are doomed. We wasted our grade 7,8,9s. Now, most of us are really under prepared for the ssc examinations. \n\nI was just wondering things like this while watching the news. And I wanted your guy's thoughts on this. And, what do you think would be a good sort of implementation? Here's the somoi TV news that I was watching: [https://youtu.be/ji5HbJGK9Nk?si=uzxwE-DYmty37izj](https://youtu.be/ji5HbJGK9Nk?si=uzxwE-DYmty37izj)",
      "url": "https://www.reddit.com/r/bangladesh/comments/1lioe7l/i_just_had_a_thought_when_i_saw_a_news_about_the/",
      "score": 2,
      "comments_count": 1,
      "created_utc": 1750703391.0,
      "author": "PossibilitySafe3070",
      "flair": "Education/শিক্ষা",
      "comments": [
        "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can [message the moderators and share the link to your post (mandatory)](https://www.reddit.com/message/compose?to=%2Fr%2Fbangladesh) if you do not receive a response within a day or two.\n\n***\n**Rule(s):** Your account should have at least 5 karma points in order to submit a post.\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/bangladesh) if you have any questions or concerns.*"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_bangladesh",
      "title": "ইনিই প্রফেসর ড: শাহজাহান তপন, যাঁর পদার্থবিজ্ঞান বই সাইন্সের স্টুডেন্টরা সবাই পড়েছে এবং পড়ছে। ১৯৯৮ সালে প্রচারিত হয়েছিলো ক্লাসটি।",
      "content": "",
      "url": "https://www.reddit.com/r/bangladesh/comments/1lidrj0/ইনই_পরফসর_ড_শহজহন_তপন_যর_পদরথবজঞন_বই_সইনসর_সটডনটর/",
      "score": 7,
      "comments_count": 3,
      "created_utc": 1750676809.0,
      "author": "moheshtorko",
      "flair": "History/ইতিহাস",
      "comments": [
        "Please provide a source for the video.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/bangladesh) if you have any questions or concerns.*",
        "That book really wasnt that good,that Ishak one wasnt better either. Most of the textbooks available in HSC standard are outright bad"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_bangladesh",
      "title": "Are UAE visas now opened for Bangladeshi citizens? If not, any news on when it might open?",
      "content": "Looking for information related to UAE visas specifically spouse visa. Applied last year for my wife but it got rejected due to her being outside the UAE.",
      "url": "https://www.reddit.com/r/bangladesh/comments/1ligaop/are_uae_visas_now_opened_for_bangladeshi_citizens/",
      "score": 4,
      "comments_count": 0,
      "created_utc": 1750684504.0,
      "author": "Ok-Pudding8375",
      "flair": "AskDesh/দেশ কে জিজ্ঞাসা",
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_bangladesh",
      "title": "I want to buys the Cmf Buds 2 plus",
      "content": "I want to buy the CMF buds 2 plus, but even after so much time of it's launching there isn't any stock. Is there any way I can import them or should I wait a little bit more?\n",
      "url": "https://www.reddit.com/r/bangladesh/comments/1lilp5o/i_want_to_buys_the_cmf_buds_2_plus/",
      "score": 2,
      "comments_count": 0,
      "created_utc": 1750697325.0,
      "author": "Israj95",
      "flair": "Discussion/আলোচনা",
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_bangladesh",
      "title": "Dhaka party",
      "content": "How to get tickets of those underground parties that happens \nAnd how to know when and where it is hapu",
      "url": "https://www.reddit.com/r/bangladesh/comments/1lill2c/dhaka_party/",
      "score": 2,
      "comments_count": 1,
      "created_utc": 1750697060.0,
      "author": "Careless-Weather8413",
      "flair": "AskDesh/দেশ কে জিজ্ঞাসা",
      "comments": [
        "Your post has been automatically put into the moderation queue for review, due to not meeting one (or more) of the subreddit rules. You can [message the moderators and share the link to your post (mandatory)](https://www.reddit.com/message/compose?to=%2Fr%2Fbangladesh) if you do not receive a response within a day or two.\n\n***\n**Rule(s):** Your account should have at least 5 karma points in order to submit a post.\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/bangladesh) if you have any questions or concerns.*"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_bangladesh",
      "title": "What a load of bull....",
      "content": "",
      "url": "https://www.reddit.com/r/bangladesh/comments/1liq4su/what_a_load_of_bull/",
      "score": 0,
      "comments_count": 8,
      "created_utc": 1750707362.0,
      "author": "PythagorasTheoremUwU",
      "flair": "Discussion/আলোচনা",
      "comments": [
        "Please provide a source for the image.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/bangladesh) if you have any questions or concerns.*",
        "You say hill tracts are now safe to visit?\n\n What tf? Are you delusional or something?",
        "Or they might follow this reddit"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Dhaka",
      "title": "What’s one thing about Dhaka you secretly love but would never admit publicly?",
      "content": "Yeah, yeah — traffic sucks, the air’s bad, and nothing ever starts on time. But be honest… there’s *one thing* about Dhaka you lowkey love but would never say out loud.\n \nDrop your guilty pleasure below. No judgment — we’re all in the same jam (literally).",
      "url": "https://www.reddit.com/r/Dhaka/comments/1ksjh1o/whats_one_thing_about_dhaka_you_secretly_love_but/",
      "score": 86,
      "comments_count": 113,
      "created_utc": 1747893433.0,
      "author": "Love-and-Dominance",
      "flair": "Discussion/আলোচনা",
      "comments": [
        "low delivery charge inside Dhaka ![gif](emote|free_emotes_pack|grin)",
        "The impoliteness of our people, yes we are rude but there is a certain charm to our frankness. Which I missed when I went abroad.",
        "Dhaka in the late nights and early mornings is one of the most precious things in my life."
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Dhaka",
      "title": "Do Bangladesh has a good future?",
      "content": "I think this country is doomed. It’s too hard to choose a side now..politically. I meant to write: Does Bangladesh have a good future?\nগ্রামার যে ভুল হইছে সেটা পোস্ট করার সাথে সাথেই বুঝেছি, কিন্তু টাইটেলতো এডিট করা যায়না, তো আই কিত্তাম? কিন্তু মজার বিষয় হচ্ছে নেটিভ ইংলিশ স্পিকারদের সাথে কথা বলার সময় গ্রামার ভুল হইলেও তারা কেয়ার করে না, কিন্তু আমাদের মূল কথা বাদ দিয়ে গ্রামার ঠিক করে দেওয়া লাগবে আগে। ",
      "url": "https://www.reddit.com/r/Dhaka/comments/1l3bhjq/do_bangladesh_has_a_good_future/",
      "score": 81,
      "comments_count": 193,
      "created_utc": 1749057873.0,
      "author": "Medusa19983",
      "flair": "Discussion/আলোচনা",
      "comments": [
        "Dishonesty— one word that defines the threat this country faces from its own people and this is the biggest enemy of this nation.",
        "Replying to the title 'NO'. I am someone who never dreamt of leaving the country. But i do want now. We are selfish, uneducated, dumb,dishonest,  religiously blind , and insecure. What else you want me to add?",
        "Bangladeshis are not good people. So the future is also not good. We only like to blame politicians or other countries for our misfortune, where we ourselves are one of the most incompetent and lazy people that there ever can be."
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Dhaka",
      "title": "Expat in Bangladesh from the Philippines",
      "content": "I will be an expat to bangladesh this 2025. My ethnicity is chinese by I grew up in the Philippines. And I have a few questions:\n\n1) Is it really worth it to move to Bangladesh for career growth? \n2) What are some good advices to enjoy my stay here?\n3) Is Gazipur a good place a safe area?\n\nAdvices outside of these questions are welcomed and appreciated! \n\nThank you!",
      "url": "https://www.reddit.com/r/Dhaka/comments/1lj1f8r/expat_in_bangladesh_from_the_philippines/",
      "score": 6,
      "comments_count": 11,
      "created_utc": 1750737760.0,
      "author": "Practical-Mall-4206",
      "flair": "Seeking advice/পরামর্শ",
      "comments": [
        "It will depend on the industry. There are tons of Chinese, Sri Lankan and Indians in BD who are living for decades. But they are in certain industries",
        "1. No\n\n2. You can enjoy foods, or trips to the sea and mountains. though i think, phillipine is much better for travel.\n\n3. No area is fully safe unless you are not careful. people might scam you because you are foreigner. but there's good people also.\n\nso overall risk reward, if the salary is very high, you can come. otherwise, you might wanna look for opportunity somewhere else (for career growth). other than that, come and travel to bangladesh anytime and experience our food and culture.",
        "why are you moving to BD ?"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Dhaka",
      "title": "What major to choose if i have passion for none?",
      "content": "Ami HSC 26 batch but ager thekei halka decide kore rakhte chacchi kon major ta nile bhalo.\n\nNo passion for any major but engineering korbo as I am good at maths (it's the only subject i enjoy) and physics. Probably IUT te porbo and plan on going abroad for higher studies.  \nSo kon major e porle abroad e scholarship pawar chances beshi hobe and preferably the job won't be very soul-sucking.",
      "url": "https://www.reddit.com/r/Dhaka/comments/1lj26u7/what_major_to_choose_if_i_have_passion_for_none/",
      "score": 4,
      "comments_count": 6,
      "created_utc": 1750740333.0,
      "author": "Adorable-Charity7877",
      "flair": "Seeking advice/পরামর্শ",
      "comments": [
        "Lol engineering manei soul sucking.",
        "First develop passion you won’t survive in uni without passion. Its a very long process You will become a living cadaver",
        "Choose engineering. everyone is miserable there, you will feel at home."
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Dhaka",
      "title": "Best wired headphone under 1000? Tired of charging wireless.",
      "content": "Please give me suggestions on buying a Wired Headphone. Not a head mounted one, just general wired headphone. My Budget is under 1000 BDT. \n\nI am tired of buying wireless airpod and charging them everyday. I can't find any review video of wired headphone in YouTube. Those are available uploaded 3-4 years ago. Every channels are reviewing wireless.",
      "url": "https://www.reddit.com/r/Dhaka/comments/1lj0vhc/best_wired_headphone_under_1000_tired_of_charging/",
      "score": 4,
      "comments_count": 4,
      "created_utc": 1750736000.0,
      "author": "Ecstatic_Roof635",
      "flair": "Seeking advice/পরামর্শ",
      "comments": [
        "Wanna try earphones? You can Check out iems then they sound wayy better than cheap headphones.",
        "KZ edc pro(balanced)/ND planet(Bass centered)",
        "Had these 👇🏻\n\nhttps://www.applegadgetsbd.com/product/realme-buds-2-wired-headphone\n\nfor years until I switched completely to wireless...very good durability with excellent sound quality and not too bulky either.."
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Dhaka",
      "title": "FoodPanda Pro Is Trash",
      "content": "",
      "url": "https://www.reddit.com/r/Dhaka/comments/1ligsqq/foodpanda_pro_is_trash/",
      "score": 60,
      "comments_count": 33,
      "created_utc": 1750685838.0,
      "author": "akira_CyberHell",
      "flair": "Events/ঘটনা",
      "comments": [
        "Wait what? I thought pandapro gave free delivery? Whats the point of having pandapro then?",
        "1. They gauges price than real ones you get in the restaurant then gives you a discount coupon.\n2. Not all restaurants are under pandapro subscription\n3. Wtf is this platform fee! \n4. They used to give vouchers every month for food and groceries, that was the only reason i subscribed.\n5. They can be as late as they want and no freaking compensation or way of communicating with them. \nMost importantly they have just been trash lately",
        "I am using since they started offering subscriptions. Age aro offer thakto. Only reason cancel akhono kori nai delivery charge kom ashe."
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Dhaka",
      "title": "Assisting students for Higher Education in Australia",
      "content": "Hi everyone, I am Zunayed, a licensed Counselor for Australian Higher Education (ICEF Certified). I am employed as a Senior Counselor for Australia at Eduko Pathways. I have 3 years experience in this industry, converting over 100 students and assisting over 700 students with their compliance, documentation and visa processes. If anyone requires any help in regards to studying abroad in Australia (Diploma, Bachelor, Masters and PhD), you can connect with me. My fb profile is as follows: https://www.facebook.com/aztashique. I am available on whatsapp as well +8801581454687. I do not charge for consultancy, and I assist students with application up until visa submission. (Condition is that you apply through me). \nLooking forward to helping you all achieve your study abroad dreams in Australia. ",
      "url": "https://www.reddit.com/r/Dhaka/comments/1lj2bg9/assisting_students_for_higher_education_in/",
      "score": 3,
      "comments_count": 1,
      "created_utc": 1750740778.0,
      "author": "AZTashique",
      "flair": "Discussion/আলোচনা",
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Dhaka",
      "title": "I need someone to talk",
      "content": "Hi there 22M here...Going through a lot lately and,need someone to talk to...Anyone up?",
      "url": "https://www.reddit.com/r/Dhaka/comments/1lim8bv/i_need_someone_to_talk/",
      "score": 25,
      "comments_count": 38,
      "created_utc": 1750698520.0,
      "author": "Creative_String_343",
      "flair": "Seeking advice/পরামর্শ",
      "comments": [
        "Dm,I'm free",
        "Feel lonely then DM me",
        "Hope. You find someone"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Dhaka",
      "title": "Any female only large facebook groups you can suggest?",
      "content": "Don't worry I'm a female as well that's why i'm asking for a community on facebook with a large fem audiences for any type of discussions, advice, tips, casting, recruiting ANYTHING to be posted. It would be great if the women of dhaka helped. I have something important to post for my women. <3",
      "url": "https://www.reddit.com/r/Dhaka/comments/1liq958/any_female_only_large_facebook_groups_you_can/",
      "score": 10,
      "comments_count": 3,
      "created_utc": 1750707642.0,
      "author": "Magnaytica",
      "flair": "Seeking advice/পরামর্শ",
      "comments": [
        "Working Women Bangladesh",
        "girl talk by shape"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Dhaka",
      "title": "I’m expecting a 4.0–4.5 GPA in SSC and people act like I’m doomed",
      "content": "So I’ve just finished my SSC exams, and I’m realistically expecting somewhere between a 4.0 to 4.5 GPA. I worked hard, but I know I’m not getting that perfect 5.0.\n\nNow everyone around me is acting like it’s the end of the world — saying things like \"You’re nothing without a 5\" or \"You’re not going anywhere.\" It’s honestly messing with my head. I feel like I’ve already failed in life, even though I gave it my best.\n\nIs it really that bad to not get a 5? Does a 4.0+ GPA mean I'm out of chances forever?\n\nWould love to hear from anyone who’s been through this and still made it somewhere in life — especially if you're from Bangladesh or followed a similar path. I need some real perspective right now. And what can I do with a 4 something gpa ?\nAre there any good collages?\nAnd btw I have completed my ssc threw vocational path (because I love computers etc )\n\nIdk what to do ",
      "url": "https://www.reddit.com/r/Dhaka/comments/1liil7c/im_expecting_a_4045_gpa_in_ssc_and_people_act/",
      "score": 22,
      "comments_count": 60,
      "created_utc": 1750690220.0,
      "author": "pi-ling",
      "flair": "Seeking advice/পরামর্শ",
      "comments": [
        "Bhai 5 paya Baal tao chirte na para mainsher obhab nai 🙏",
        "Brother, I'm expecting Gpa 5 but my parents are mad Why isn't you're expecting Golder A+? \nCuz I know i did bad in maths",
        "Idk the details but I have a cousin who got 4.1 in hsc or something and is now in the US working in a pharmacy related job.. \n\nso ig no not getting a perfect 5 doesn't matter..try to relax and keep working hard!!"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Dhaka",
      "title": "Advice",
      "content": "I Don't have any soft skills,goods at nothing. Also not so up to date and techy. Because of all i feel lack of confidence. Recently I graduated from a University and successfully unemployed.Feeling very low and lost.i am lossing my Weight everyday.I can't sleep at night, and having a poor immune system.\nGive me some advice. \n",
      "url": "https://www.reddit.com/r/Dhaka/comments/1liwsn5/advice/",
      "score": 4,
      "comments_count": 4,
      "created_utc": 1750723842.0,
      "author": "LowHunter4981",
      "flair": "Seeking advice/পরামর্শ",
      "comments": [
        "It's not enough information. DM me if you're comfortable.",
        "You are not good enough because many Bangladeshis mock you just because they are jealous. Every single people in this earth good at different soft skills. All you have to do is find it out yourself."
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Dhaka",
      "title": "Wanna leave this country ASAP",
      "content": "Hi everyone, I’m a 24-year-old female who recently completed my BPharm from a reputable university with a good CGPA. I’ve been trying to land a pharmacy-related job for months, but most positions here require either a master’s degree or prior experience — and they prefer candidates who’ve already completed post-grad. To be honest, I’m also really fed up with the toxic environment around me — both personally and professionally — and it’s affecting my mental health. I’m at a point where I just want to start fresh somewhere new, grow on my own, and build a stable future. I’m seriously considering pursuing a Master’s degree abroad, ideally in Pharmacy, Public Health, or a related biomedical field. My main constraints: • I come from a middle-class family, so I can’t afford high tuition fees • I’m willing to work part-time or do odd jobs to support myself while studying • I’m looking for a country with affordable tuition, student-friendly visa policies, and a chance to build a decent life post-study I’ve heard that countries like Germany, Finland, Norway, or even some Eastern European nations offer low-cost or tuition-free education. I’m also open to the UK or Canada if I can find scholarships or work enough to sustain myself. If anyone here has been in a similar situation, I’d really appreciate: • Suggestions for countries/universities/programs to look into • How realistic it is to support yourself while studying • Any tips on scholarships, budgeting, or surviving that first lonely year abroad • Honest feedback on whether I’m being too hopeful 😅\nAny advice would really help. Thanks in advance to anyone who reads or replies. 🙏\nEdit : i have been trying to reply all comments ,but idk why it is not getting visible,sorry for the inconvenience,if you want you can dm me also!",
      "url": "https://www.reddit.com/r/Dhaka/comments/1lii5yc/wanna_leave_this_country_asap/",
      "score": 23,
      "comments_count": 38,
      "created_utc": 1750689204.0,
      "author": "CallNo886",
      "flair": "Seeking advice/পরামর্শ",
      "comments": [
        "The problem with germany is the long waiting period.. If you apply for appointment now you night get appointment 2.5 years later (no specifics) others you can try...\n\nP.s not discouraging Germany..its quite good...just giving some info for consideration.\n\nUK is quite expensive...they rarely give fully funded ones..dont know about pharmacy field...most of their scholarship only cover 1-5% of the total fees.",
        "My advice would be first know how much your family can spend on your education then select countries and universities based on that. Scholarship for masters in Canada is rare. Europe is a valid option still you will need around 20lakh for masters. Maybe less in some parts of Europe.\n\nYou can't cover your tuition fees by doing odd jobs in any country. So forget about that. Overall scholarship opportunities in Europe are much lower for masters as most European countries don't offer TAship or RAship to masters students. Try for Erasmus scholarship. It's competitive but will cover full cost. You can also look into S. Korea for cheaper tuition fees and they offer around 50% scholarship if your cgpa is high.",
        "I have been living in Canada since 2007. You mentioned doing odd/part-time jobs. I just want to say, the economy is very bad in Canada right now. Even the odd jobs are hard to find. There is this silent racism/discrimination in the job market. For example, Indians are only Indians. Even the locals are not getting McDonald's jobs. That's how bad things are. Grocery, rentals are super expensive.\n\nNot trying to put you down but want you to acknowledge before you step in here."
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Dhaka",
      "title": "Why do we always move on? How many Ispitas will it take for us to wake up?",
      "content": "\nIspita was a bright, brave, and hardworking student of Zoology, 3rd year, at Bhola Govt. College. A girl full of hope, once believing in change. She tried politics, only to walk away after seeing how dirty and cruel it truly is. She was also the daughter of an auto driver. A father who now stands shattered, crying out the most heartbreaking question:\n\n> \"Ami auto driver, amar meyer bichar ki pabo?\"\n(\"I am an auto driver, will I ever get justice for my daughter?\")\n\n\n\nShe was gang raped on the Karnaphuli-4 launch. On that night, maybe she jumped into the river to escape. Maybe they threw her in after they were done. Either way, she died. Her body was found days later and buried as beyowarish, like she was no one. No name. No dignity. No justice.\n\nNow her classmates are saying what we all fear. This might not have been random. Maybe it was a planned attack. Maybe someone wanted to silence her. Someone who couldn’t accept her voice, her spirit, her courage.\n\nAnd here we are. Scrolling. Posting. Feeling angry for a few hours or a couple of days. Then forgetting. Like we always do.\n\nWhy do we let this happen every time?\nWhy do we treat rage like a trend instead of a responsibility?\nWhy do we only act when tragedy knocks on our own door?\n\nWhat’s even worse is what comes next. Tomorrow, people will say she was characterless. They will ask what she was wearing. They will blame her instead of the monsters who did this. That is how it always goes. That is why this continues.\n\nThis incident is not isolated. It is a result of what we allowed. Just recently, a man beat up two women in public on a launch, and nothing happened to him. No arrest. No punishment. That silence gave courage to the next group of predators.\n\nSo again, I ask:\n\nWhy do we stay quiet?\nWhy do we only react for a moment and then go back to normal life?\nWhy do we let our sisters die like this and then move on?\n\nWe failed Ispita.\nWe failed her father.\nAnd unless we act, we will keep failing others too.\n\nThis country owes them justice. And it owes us accountability. Not silence.\n",
      "url": "https://www.reddit.com/r/Dhaka/comments/1libpva/why_do_we_always_move_on_how_many_ispitas_will_it/",
      "score": 64,
      "comments_count": 17,
      "created_utc": 1750669196.0,
      "author": "ArhodAditya",
      "flair": "Events/ঘটনা",
      "comments": [
        "because everyone is a coward... 99% of the people in this country are cowards who would never stand up, the 99% of the 1% remaining are cowards who would only stand up if others stand up, and from this 1%, 99% are cowards who would stand up, but wouldnt ever take the lead, and the remaining percentage is the amount of people who are actually brave",
        "Another girl raped. Another body dumped. Another father wailing in front of a camera with the audacity to *ask* for justice, like justice is some gift only the rich and well-connected get wrapped in ribbon.   \n  \n\"Ami auto driver, amar meyer bichar ki pabo?\" I think you already know the answer. In this country? Justice depends on your title, your tie, or maybe even your *terrifying silence*.\n\nIspita may have been bold, brilliant, and perhaps dangerous not because she had a weapon, but because she had a spine unlike many people I know. She dared to think change was possible, that maybe the dirt of politics could be scrubbed off with courage and clarity. *Guess what?* The system doesn’t like clean hands. So it swallowed her whole, then spat her into a river. Left her to rot like *trash*. Like her name, her soul, and her scream didn’t matter.\n\nAnd what are *we* doing?\n\nScrolling. Double-tapping. Writing a sad little caption with a black background and a broken heart emoji, and calling it activism.   \n  \nAlso I disagree about cowardice.  \n  \nWe’re not *afraid* to speak up, *we’re too damn busy*. With our own crumbling lives, our rents, our GPAs, our mental breakdowns dressed as productivity. And the bastards who run this mess? They *count on that distraction*. They *rely* on our short attention spans like it’s a renewable energy source.\n\nThey know you’ll forget.  \nThey know I’ll forget.  \nBecause we always do.\n\nIspita's story is definitely not the first and it sure as hell ain't gonna be the last. How many more Ispitas do we need to wash up dead before we realize this isn’t random — *it’s the design*? It's the *reward system* for staying loud, for staying brave, for not shutting the hell up. They murdered her to warn the next girl who dares to dream.\n\nAnd you know what’s coming tomorrow. The whisper campaign. “Maybe she had a boyfriend.” “Why was she out that late?” “What was she wearing?” *As if a piece of cloth has ever stopped a predator.* As if rape needs a *reason* beyond power and impunity.\n\nWe don’t need candle marches. We need *torches* and not the romantic kind. We need the angry, burning, metaphorical kind you chase monsters with. We need names. Arrests. Trials. *Consequences*. Not this endless circus of hashtags and hollow outrage.",
        "Most of the men in Bangladesh are like this. Ei poribesh chele sontan manush kora khub kothin coz too much misogyny."
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Dhaka",
      "title": "I've everything, yet I feel thoroughly broken",
      "content": "I'm everything what the average Bangladeshi parent wants their kid to be. I study in arguably the best program in the country. I earn enough to sustain three families comfortably . I've gifted myself every material thing I've wanted since my childhood from my own earning.I have a stable relationship with my family, friends.I don't have any major physical issues or anything I need to be too tensed about. I do not believe in the abrahamic god, but have my own general understanding of the world. I'll probably graduate with a stellar CGPA and leave this unfortunate place in search of a much better future.\n\nYet I feel like there is something fundamentally wrong with me. I am always on the run in a metaphysical sense, running away from everywhere, everyone. If anybody saw me on the outside perhaps they couldn't tell what I'm going through, yet every moment I pray for it to be my last. I just wish I could trade everything for a sane mind. I wish for nothing more but to be at peace with myself. I've always been like this as far as I remember. Whenever I'm around everybody else, I'm your perfect role model. Whenever I'm alone with myself , I wish I didn't hate myself so much. It's not like I need anybody. \n\nThose of you who are on good terms with yourself, your mind and soul, I think there's no gift greater than it.",
      "url": "https://www.reddit.com/r/Dhaka/comments/1lionmj/ive_everything_yet_i_feel_thoroughly_broken/",
      "score": 10,
      "comments_count": 13,
      "created_utc": 1750703991.0,
      "author": "True_Secretary8711",
      "flair": "Discussion/আলোচনা",
      "comments": [
        "It’s the loneliness buddy. You need to get laid.",
        "\nI think I have something similar going on, and honestly, I feel like there’s something wrong with me.\n\nLet me explain real quick —\nSometimes I feel completely numb, like I have no empathy at all. Other times, I feel so much that I don't even know how to handle it.\nMost of the time, I’m emotionally numb to everything… except self-hatred.\n\nWhen I look in the mirror, I feel disgusted.\nWhen someone praises me, it doesn’t make me happy — it actually makes me feel worse, like I’m breaking a little inside.\n\nAnd when I’m alone, I get scared.\nThe strange part is, my life is pretty normal. But I still have these feelings, and I don’t really know why — I just know they’re there.",
        "Help people. Meaning comes from whatever you can conjure but helping people gives a purpose. Help them with the sole intention of just being there for them"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Dhaka",
      "title": "Thrift business",
      "content": "wanna start thrift business in dhaka. anyone suggest how can i get thrift product wholesale in dhaka?",
      "url": "https://www.reddit.com/r/Dhaka/comments/1lj4ejn/thrift_business/",
      "score": 1,
      "comments_count": 0,
      "created_utc": 1750748573.0,
      "author": "Agreeable_Dress_4558",
      "flair": "Seeking advice/পরামর্শ",
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Chittagong",
      "title": "Ccpc vs Chittagong College এর monthly fees কতো?",
      "content": "Chattogram Cantonment public college এর monthly fees কতো? আর Chattogram College এর monthly fees কতো? কেউ একটু বলতে পারলে অনেক ভালো হতো, thanks in advance xx :>",
      "url": "https://www.reddit.com/r/Chittagong/comments/1lili8o/ccpc_vs_chittagong_college_এর_monthly_fees_কত/",
      "score": 2,
      "comments_count": 3,
      "created_utc": 1750696880.0,
      "author": "frootjackpink",
      "flair": null,
      "comments": [
        "Govt. Colleges (including Chittagong College) er yearly fees 1-2k\nCCPC te monthly fees 3k and add-ons afaik"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Chittagong",
      "title": "Moving to Chittagong Next Month – Looking for Peaceful Places to Rent & Exploration Tips",
      "content": "Hello People,\n\nI’ll be moving to Chittagong next month and staying for around 4–6 months. My main goal is to explore the region as much as possible — not just the city itself, but also the nature, culture, and hidden gems around greater Chittagong.\n\nSince I grew up in Dhaka, I’d prefer not to live right in the heart of the city. I’m looking for a peaceful place to rent — somewhere quiet and less chaotic, but still close enough to the city to access daily necessities easily.\n\nI’d love suggestions on:\n\n* Which neighborhoods or areas would be ideal for this kind of lifestyle?\n* Any offbeat places around Chittagong you think I should explore?\n* Any general tips or guidance for someone planning to experience the \"other side\" of CTG?\n\nI’d really appreciate your insights or personal experiences. Thanks in advance for the help! 🙏",
      "url": "https://www.reddit.com/r/Chittagong/comments/1lihgd3/moving_to_chittagong_next_month_looking_for/",
      "score": 1,
      "comments_count": 0,
      "created_utc": 1750687494.0,
      "author": "rakibNnirob",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Chittagong",
      "title": "CU admission exam",
      "content": "Hi, I'm HSC 25 batch. I need some advice from you guys. I'm in commerce and I was thinking about skipping HSC this year to take the exam next year. If I do so, can I still take the CU's admission exam? And what are the rules in this sort of situations? Also if any of you did the same, was it worth it? I'd love to hear from you guys. ",
      "url": "https://www.reddit.com/r/Chittagong/comments/1lhyl2p/cu_admission_exam/",
      "score": 6,
      "comments_count": 5,
      "created_utc": 1750626169.0,
      "author": "CluelessWondererMax",
      "flair": null,
      "comments": [
        "I don't think it's worth it. If u have like 50-60% prep, sit for the exam. If u somehow miss A+, u still have a chance to appear in the admission exam. Ik it will cut some mark but if u have a solid admission prep then it wont matter really. \n\nOn the other hand, if u don't then it will take one year from ur life & what if u couldn’t crack 2nd time also (will considered first time though)? \n\nSo appear.",
        "mate only 2 days left, its the fear that freakin myself out too. Les head up and face it",
        "Yes you can sit for HSC next year and sit for CU. I think it is considered as first time like anyone else. Can’t tell if it’s worth it."
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Chittagong",
      "title": "Need help",
      "content": "So, I'm from Dhaka. I got into CU. Session:2024-25. I haven't been able to find any place to stay... Don' know anyone there so little bit tensed. Tried many FB grps but no luck...Can anyone please tell me what can I do now? I was looking for accommodation around the varsity area...  I'll be living alone(shared flats are ok too). And if there is meal system it'd be really helpful... Looking for suggestions from the experience.  Thanks in advance  ",
      "url": "https://www.reddit.com/r/Chittagong/comments/1lho7z9/need_help/",
      "score": 7,
      "comments_count": 11,
      "created_utc": 1750599836.0,
      "author": "Mundane-Long6060",
      "flair": null,
      "comments": [
        "U can try finding accomodations in the city near Muradpur and 2No. gate areas close to the train to get to campus. It's part of the CU experience but it's not everyone's cup of tea.",
        "Many bachelors will find houses in the area near Sholashahar Rail Station, and once they get used to living in Chittagong, they often move to better houses near the university, which is a very pleasant and attractive area",
        "Have you posted [here](https://www.facebook.com/groups/2431058513879027/?ref=share&mibextid=NSMWBT) ? If not, you should. Hopefully you will get help from Dhaka association members.\n\nMoreover, if you are a girl or admitted at IFESCU then choose south campus. Varsity 2 no. gate can be a better option also but it gets a little bit messy about transportation at the peak time. Another option is varsity 1 no. gate. But here the rents are a bit higher."
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Chittagong",
      "title": "Café + Library Vibes in Chittagong?",
      "content": "Does anyone know a safe place in Chittagong where you can chill and read books to kill time? Like a cozy mix of a café and a public library—somewhere you can sit for hours without anyone bothering you and you can stay as long as you want?",
      "url": "https://www.reddit.com/r/Chittagong/comments/1lhr1m2/café_library_vibes_in_chittagong/",
      "score": 4,
      "comments_count": 14,
      "created_utc": 1750607246.0,
      "author": "Fit-Dish-7260",
      "flair": null,
      "comments": [
        "Go to bathighor read books you like and just across the street (very close to bathighor) u can go to a place called \"honest\" to chill there and have coffee or some snacks (a very chill area)",
        "There is one in jamal khan. Forgot the name. Search in fb.",
        "It’s okay if it’s not a café, no worries — but at least a place where I can kill time, you know? Somewhere I won’t be bothered to leave and can stay as long as I want."
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Chittagong",
      "title": "Chittagong War Cemetry",
      "content": "Hi, I have a relative buried here (from UK) but there are no photos of the plot available online. \n\nWould anyone who is local or perhaps planning a visit be able to take a photograph if I send the plot number / name etc?\n\nThank you in advance. ",
      "url": "https://www.reddit.com/r/Chittagong/comments/1lhj6u7/chittagong_war_cemetry/",
      "score": 4,
      "comments_count": 2,
      "created_utc": 1750581574.0,
      "author": "BC_Jeff",
      "flair": null,
      "comments": [
        "Hi, u can DM me but the thing they don’t allow anyone inside the plot area only in some rare cases. But still u can text me let me see if i can get a chance to photo of the plot"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Chittagong",
      "title": "Lonely, Lost, and Depressed – Where Do I Go From Here?",
      "content": "24y here. Average height-wise and looks-wise, skinny, low on self-confidence, extremely introverted, depressed, and currently unemployed. I’ve never been in any kind of relationship, have no close friends, and I suspect I might have ADHD.\n\nI’ve deleted all social media (except Reddit) and even stopped viewing WhatsApp statuses — seeing others find love, succeed in their careers, go on trips, etc., just hurts me and makes me even more angry with myself. I’m truly happy for them, but lately I’ve been feeling like there’s no meaning to MY life; that everything is either black or white (you either know what you’re doing / what you want to do OR you’re just like me – clueless, hopeless, angry, empty and depressed)\n\nPart of me has accepted that I might always be alone, but another part still wants to believe that I can turn things around, build a better version of myself, and maybe (just maybe) someday find a genuine connection. So, I’m looking for some advice or guidance from people who have been in a dark place and found a way out OR just anyone who is willing to help me improve my situation.\n\n**Could you please share:**\n\n1. **How to start appreciating everything that life throws at you when you’re completely alone and feel directionless ?**\n2. **If meaningful relationships aren’t in my future, how do I learn to live with and manage that loneliness (mostly arising due to the lack of emotional intimacy) ?**\n3. **How to take baby steps in building self-esteem, confidence, and inner peace ?**\n\nI can’t afford to seek therapy as of now. So any experience or advice that you all share in the comments will be my only source of support (and therapy). Thank you guys in advance !",
      "url": "https://www.reddit.com/r/Chittagong/comments/1lhk364/lonely_lost_and_depressed_where_do_i_go_from_here/",
      "score": 2,
      "comments_count": 4,
      "created_utc": 1750585368.0,
      "author": "Ok_Pie_8569",
      "flair": null,
      "comments": [
        "I wish I could help (I've been through what you have) but for some reason I can't express through words on what I want to say (what I'd recommend post this Reddit post on r/Dhaka community and someone will give u an answer as the Chittagong community is much smaller)",
        "This might sound corny but maybe you should try journaling. Nah not the fancy once. Just try morning pages & gratitude journal. Perhaps things will ease a bit. Also, you might give a visit to psychiatrist if you feel much disturbance. Don't avoid if you think You'll need it. Also, try to join clubs and volunteer activists ig.",
        "> 24y here. Average height-wise and looks-wise, skinny, low on self-confidence, extremely introverted, depressed, and currently unemployed\n\nYour first priority should be getting a job, not bitches."
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Chittagong",
      "title": "Book Clubs to join?",
      "content": "Hello! I'm trying to be an avid reader, and a book club that facilitates discussions on books would be a great way to achieve this purpose. Are there any in Chittagong? I would love to join!",
      "url": "https://www.reddit.com/r/Chittagong/comments/1lhhw77/book_clubs_to_join/",
      "score": 3,
      "comments_count": 1,
      "created_utc": 1750576262.0,
      "author": "ApprehensiveCold1149",
      "flair": null,
      "comments": [
        "Lemme know if you find one"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Chittagong",
      "title": "Any shops to suggest for buying affordable cargo pants in Chittagong?",
      "content": "",
      "url": "https://www.reddit.com/r/Chittagong/comments/1lhb30v/any_shops_to_suggest_for_buying_affordable_cargo/",
      "score": 3,
      "comments_count": 2,
      "created_utc": 1750552303.0,
      "author": "edm-mad",
      "flair": null,
      "comments": [
        "Look in VIP Tower, just bargain."
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Chittagong",
      "title": "Any software engineer working in Chittagong?",
      "content": "I am currently working remote in a company as a backend developer. Particularly my role is building api with django rest framework and DBMS.\nI want to experience onsite now. But i don't know how many companies are here, which one is hiring? Or how even i know the companies accept hiring or not, how can i find? I'm really low thinking how can i get to know that without networking. Sad that i have no idea what to do now, the bdjobs is totally empty with posts. I really want advice from those who are working here please and thanks.",
      "url": "https://www.reddit.com/r/Chittagong/comments/1lh7epi/any_software_engineer_working_in_chittagong/",
      "score": 2,
      "comments_count": 6,
      "created_utc": 1750541545.0,
      "author": "anik_the_supreme",
      "flair": null,
      "comments": [
        "There aren't any good Software firms in Chittagong. You may find a good working environment in a few, but the salary range is very low.\nI won't recommend any onsite company unless you are a fresher. As an experienced developer, almost all software engineers move to Dhaka for onsite jobs.",
        "how much do you earn now?",
        "If you want to work in the startup sector I would recommend going to Slyhet.\n\nThere are alot of startup from Slyhet doing great dorik, doplac to name a few"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Chittagong",
      "title": "Chittagong to Dhaka train ticket availability",
      "content": "I have checked online and there's no ticket for ctg to dhaka. Is it possible to have tickets from the station?",
      "url": "https://www.reddit.com/r/Chittagong/comments/1lgvwvj/chittagong_to_dhaka_train_ticket_availability/",
      "score": 3,
      "comments_count": 2,
      "created_utc": 1750510519.0,
      "author": "Massive-Bank3059",
      "flair": null,
      "comments": [
        "I don't think so. You can get standing ticket but It's not worth it imo. Try bus instead.",
        "Visit the Ak Khan mor or Dampara during your visit. You will get a lot of ticket commission agents there. Just bargain with them and you may get a sleeper ac bus ticket for 600-700 tk bdt. Do not offer more than that. And do not buy before you checkout the bus and happy to give it a go."
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Chittagong",
      "title": "Got Bored!!",
      "content": "",
      "url": "https://www.reddit.com/r/Chittagong/comments/1lg86jf/got_bored/",
      "score": 6,
      "comments_count": 30,
      "created_utc": 1750436474.0,
      "author": "rador6192",
      "flair": null,
      "comments": [
        "Make a paper boat and then name it",
        "Wanna talk n be friends?",
        "Ello mate. Me bored aswell"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Chittagong",
      "title": "Should I choose an MBA or a Master’s program?",
      "content": "My background is in engineering, and I studied at a private university. I recently took the CUCBA- MBA entrance exam and got selected. The MBA program costs around 220,000 and takes 2 years to complete.\n\nHowever, I'm struggling with confidence about this decision. My family's financial situation is average, and I’m trying to make a serious, practical choice. Should I go ahead with the MBA, or consider a more affordable 1-year Master’s program from a university like NU or others?\n\nI mean MBA over Master’s, good deal?\nI would really appreciate some honest advice.",
      "url": "https://www.reddit.com/r/Chittagong/comments/1lg9gk7/should_i_choose_an_mba_or_a_masters_program/",
      "score": 4,
      "comments_count": 5,
      "created_utc": 1750439597.0,
      "author": "UniqueFig2703",
      "flair": null,
      "comments": [
        "Go for EDU or Primer University—don’t choose CUCBA for your MBA. It’s not a wise decision, and you might regret it later. I’m speaking from personal experience—CUCBA isn’t a good option for MBA admission.",
        "If you're facing financial struggle, choose other universities instead of CUCBA. The choice of university depends on which major you'll do. For example: if university 'x' doesn’t have enough students who wants to major in HRM, they won't run the program. Best of luck."
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Chittagong",
      "title": "Anyone working remotely from Chattogram",
      "content": "Hi everyone. I would like to know how many of you guys are currently working remotely or have worked from Chattogram and what is your future plan.\n\nI am a software engineer working in an Australian based start-up with a decent salary.\n\nMy personal experience with the Chittagong based software firms is very bitter. Most of the Dhaka based software firms are not that good either in case of work environment.\n\nIn that case have anyone of you returned to any local company and what was your experience?",
      "url": "https://www.reddit.com/r/Chittagong/comments/1lfxbgm/anyone_working_remotely_from_chattogram/",
      "score": 5,
      "comments_count": 1,
      "created_utc": 1750402205.0,
      "author": "Southern-Coconut-757",
      "flair": null,
      "comments": [
        "Heyya! Working in a Malaysian based firm from CTG as a software Dev. \nI never tried ctg based firms, they all are shit both salary and environment wise."
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_Chittagong",
      "title": "Place suggestions",
      "content": "Any place with a peaceful atmosphere, not too crowded, where we can sit comfortably, have a good chat, and enjoy the view — could be a nice spot or even a good restaurant.\n\n",
      "url": "https://www.reddit.com/r/Chittagong/comments/1lg0kcz/place_suggestions/",
      "score": 2,
      "comments_count": 11,
      "created_utc": 1750415150.0,
      "author": "SecretRecipe1639",
      "flair": null,
      "comments": [
        "DC Hill is usually pretty chill, especially in the morning. Jamalkhan is good during afternoon but it gets crowded in the evening. Night time is probably best spend at any restaurant",
        "CRB HELLA CHILL😂😭",
        "Tbh I love link roadddd for that"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_sylhet",
      "title": "Need to learn the language! Any tips or courses",
      "content": "So my soon to be fiancé is sylehti and his mum has trouble with speaking English so I plan to learn sylehti however I’m starting from scratch and I’m not surrounded by many bengalis so I was wondering if anyone had any tips to help me out",
      "url": "https://www.reddit.com/r/sylhet/comments/l3vji2/need_to_learn_the_language_any_tips_or_courses/",
      "score": 11,
      "comments_count": 20,
      "created_utc": 1611476263.0,
      "author": "klaussalvatore52",
      "flair": null,
      "comments": [
        "Memrise has a free beginner's course called \"Sylheti (Basic Conversation)\"",
        "Did you succeed?"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_sylhet",
      "title": "PLEASE URGENT HELP",
      "content": " A friend of mine on Discord is in imminent danger. He lives in Sylhet. He and his father got into a massive argument and his father said that he needs to kill himself by tomorrow or his father will kill him. He has no place to go. I have his name and address, please help.\n\nPlease help.",
      "url": "https://www.reddit.com/r/sylhet/comments/jo7g33/please_urgent_help/",
      "score": 2,
      "comments_count": 9,
      "created_utc": 1604532248.0,
      "author": "SkurkyRL",
      "flair": null,
      "comments": [
        "fagol sagol",
        "any update?",
        "Yabba dabbba doo"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_sylhet",
      "title": "Habra Haat Bazar & Fish Market - Biswanath Sylhet হাবড়া হাট বাজার এন্ড মাছ বাজার - বিশ্বনাথ সিলেট",
      "content": "",
      "url": "https://www.reddit.com/r/sylhet/comments/j3cu0b/habra_haat_bazar_fish_market_biswanath_sylhet_হবড়/",
      "score": 3,
      "comments_count": 0,
      "created_utc": 1601572504.0,
      "author": "BD_Media",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_sylhet",
      "title": "Bhober Haat Bazar - Jagannathpur Sylhet ভবের বাজার, জগন্নাথপুর সিলেট।",
      "content": "",
      "url": "https://www.reddit.com/r/sylhet/comments/ifux7g/bhober_haat_bazar_jagannathpur_sylhet_ভবর_বজর/",
      "score": 2,
      "comments_count": 0,
      "created_utc": 1598294348.0,
      "author": "BD_Media",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_sylhet",
      "title": "Coronavirus Food Relief Corruption – Sylhet & Khulna করোনাভাইরাস খাদ্য ত্রাণ দুর্নীতি সিলেট/খুলনা",
      "content": "",
      "url": "https://www.reddit.com/r/sylhet/comments/g0lzj3/coronavirus_food_relief_corruption_sylhet_khulna/",
      "score": 2,
      "comments_count": 0,
      "created_utc": 1586794339.0,
      "author": "BD_Media",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_sylhet",
      "title": "London Probashi Help Bangladesh during Lockdown লন্ডন প্রবাসী বাংলাদেশীদের সহায়তা করছে",
      "content": "",
      "url": "https://www.reddit.com/r/sylhet/comments/fwruzj/london_probashi_help_bangladesh_during_lockdown/",
      "score": 1,
      "comments_count": 0,
      "created_utc": 1586290766.0,
      "author": "BD_Media",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_sylhet",
      "title": "Coronavirus Bangladesh Total Lockdown করোনা ভাইরাস বাংলাদেশ মোট লকডাউন",
      "content": "",
      "url": "https://www.reddit.com/r/sylhet/comments/fre51w/coronavirus_bangladesh_total_lockdown_করন_ভইরস/",
      "score": 1,
      "comments_count": 0,
      "created_utc": 1585518871.0,
      "author": "BD_Media",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_sylhet",
      "title": "Coronavirus Police Crackdown - Bangladesh করোনাভাইরাস পুলিশ ক্র্যাকডাউন - বাংলাদেশ",
      "content": "",
      "url": "https://www.reddit.com/r/sylhet/comments/fp05li/coronavirus_police_crackdown_bangladesh_করনভইরস/",
      "score": 1,
      "comments_count": 0,
      "created_utc": 1585176976.0,
      "author": "BD_Media",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_sylhet",
      "title": "State of Coronavirus - Sylhet Bangladesh বাংলাদেশ সিলেটে করনাভাইরাস এর অবস্থা",
      "content": "",
      "url": "https://www.reddit.com/r/sylhet/comments/fn80pm/state_of_coronavirus_sylhet_bangladesh_বলদশ_সলট/",
      "score": 1,
      "comments_count": 0,
      "created_utc": 1584913957.0,
      "author": "BD_Media",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_sylhet",
      "title": "MoulviBazar Fish Market - Sylhet | 4K মৌলভীবাজার ফিশ মার্কেট - সিলেট | 4K",
      "content": "",
      "url": "https://www.reddit.com/r/sylhet/comments/fmfelz/moulvibazar_fish_market_sylhet_4k_মলভবজর_ফশ_মরকট/",
      "score": 2,
      "comments_count": 0,
      "created_utc": 1584799303.0,
      "author": "BD_Media",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_sylhet",
      "title": "Beani Bazar",
      "content": "",
      "url": "https://www.reddit.com/r/sylhet/comments/dv1pgb/beani_bazar/",
      "score": 10,
      "comments_count": 1,
      "created_utc": 1573517915.0,
      "author": "[deleted]",
      "flair": null,
      "comments": [
        "Where in beani bazar is that? I was born in beanibazar"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_sylhet",
      "title": "Beani Bazar",
      "content": "",
      "url": "https://www.reddit.com/r/sylhet/comments/dradvu/beani_bazar/",
      "score": 3,
      "comments_count": 0,
      "created_utc": 1572831299.0,
      "author": "[deleted]",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_sylhet",
      "title": "Madhabkunda, Sylhet",
      "content": "",
      "url": "https://www.reddit.com/r/sylhet/comments/di5hi5/madhabkunda_sylhet/",
      "score": 4,
      "comments_count": 0,
      "created_utc": 1571132429.0,
      "author": "chilliboomba",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_sylhet",
      "title": "Sylhet Bondor Bazar",
      "content": "",
      "url": "https://www.reddit.com/r/sylhet/comments/d9l5zd/sylhet_bondor_bazar/",
      "score": 2,
      "comments_count": 1,
      "created_utc": 1569511662.0,
      "author": "Shoaibkaiser",
      "flair": null,
      "comments": [
        "sylhet,bondor bazar,sylhet bondor bazar,bondor bazar sylhet,sylhet bondor bazar fresh vegetable market,bazar,bondor lal bazaar sylhet,sylhet bazar,sylhet bondor 2019,sylhet to bondor fish market,hat bazar,bondor lal bazar,bondor bazar 2019,250 kg fish in bondor lal bazer sylhet,bondor,sylhet 2 london,sylhet to london,sylhet 2nd london,sylhet (city/town/village),lal bazar,''bondor bazar''"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_sylhet",
      "title": "Lalakhal, Sylhet, Bangladesh",
      "content": "",
      "url": "https://www.reddit.com/r/sylhet/comments/d8l4li/lalakhal_sylhet_bangladesh/",
      "score": 3,
      "comments_count": 0,
      "created_utc": 1569319983.0,
      "author": "Zwadesht",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_BangladeshPolitics",
      "title": "r/BangladeshPolitics Lounge",
      "content": "A place for members of r/BangladeshPolitics to chat with each other",
      "url": "https://www.reddit.com/r/BangladeshPolitics/comments/hc8dql/rbangladeshpolitics_lounge/",
      "score": 2,
      "comments_count": 1,
      "created_utc": 1592599351.0,
      "author": "mohiemen",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_BangladeshPolitics",
      "title": "Who do guys think will be the next prime minister of Bangladesh?",
      "content": "With Hasina gone, and Muhammad Yunus now as an interim advisor. When the election is held, who do you guys think can become the prime minister of Bangladesh. As far as I can see, only major party that is going to contest is the BNP. Do you guys think any other parties have any chance?",
      "url": "https://www.reddit.com/r/BangladeshPolitics/comments/1hr3yel/who_do_guys_think_will_be_the_next_prime_minister/",
      "score": 3,
      "comments_count": 4,
      "created_utc": 1735741759.0,
      "author": "hive_master",
      "flair": null,
      "comments": [
        "Parties like Jamat have more chance to win the election, but I truly support Awami League. If I had to vote, I'd vote for Awami League, as you can't forget their legacy. Jamaat is a party that will turn Bangladesh into a new Pakistan and Afghanistan."
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_BangladeshPolitics",
      "title": "Thousands rally in Bangladesh capital as major political party demands quick reforms and an election",
      "content": "",
      "url": "https://www.reddit.com/r/BangladeshPolitics/comments/1gn842a/thousands_rally_in_bangladesh_capital_as_major/",
      "score": 1,
      "comments_count": 0,
      "created_utc": 1731151743.0,
      "author": "_II_I_I__I__I_I_II_",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_BangladeshPolitics",
      "title": "Survey about Womens reproductive health in Bangladesh",
      "content": "[https://docs.google.com/forms/d/1Ij2bxj8sp-ffefe9zGY7KSF76uteDhcKkQqs97jWmNQ/edit](https://docs.google.com/forms/d/1Ij2bxj8sp-ffefe9zGY7KSF76uteDhcKkQqs97jWmNQ/edit)",
      "url": "https://www.reddit.com/r/BangladeshPolitics/comments/1ghuhh1/survey_about_womens_reproductive_health_in/",
      "score": 2,
      "comments_count": 0,
      "created_utc": 1730547476.0,
      "author": "TinyIngenuity917",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_BangladeshPolitics",
      "title": "A teenager, college student being taken away by Army while being tortured for committing blasphemy against Pedo, Child Rapist and Mass Murderer Prophet Muhammad ( Peace be upon him) ",
      "content": "",
      "url": "https://www.reddit.com/r/BangladeshPolitics/comments/1ghud6i/a_teenager_college_student_being_taken_away_by/",
      "score": 0,
      "comments_count": 0,
      "created_utc": 1730547003.0,
      "author": "Equivalent_Dog_3891",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_BangladeshPolitics",
      "title": "Today best pic",
      "content": "",
      "url": "https://www.reddit.com/r/BangladeshPolitics/comments/1fu6e62/today_best_pic/",
      "score": 1,
      "comments_count": 0,
      "created_utc": 1727837771.0,
      "author": "Street_Ad_4954",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_BangladeshPolitics",
      "title": "Help Buddho Bangladesh. An appeal to the United Nations to prosecute Bangladeshi terrorists, something we have not seen in the last fifteen years, is now signaled by Yunus. Save the country from Yunus terrorists #UnitedNation #Unitedhumanrights",
      "content": "",
      "url": "https://www.reddit.com/r/BangladeshPolitics/comments/1fldmh8/help_buddho_bangladesh_an_appeal_to_the_united/",
      "score": 2,
      "comments_count": 0,
      "created_utc": 1726843204.0,
      "author": "vkshutter",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_BangladeshPolitics",
      "title": "US plans economic talks with Bangladesh’s interim leader Muhammad Yunus",
      "content": "",
      "url": "https://www.reddit.com/r/BangladeshPolitics/comments/1fdm54v/us_plans_economic_talks_with_bangladeshs_interim/",
      "score": 3,
      "comments_count": 0,
      "created_utc": 1725985768.0,
      "author": "_II_I_I__I__I_I_II_",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_BangladeshPolitics",
      "title": "Britain was poor and then it learned how to be world leaders from Indian Mughals. Did you know it? Also, first a Brexit happened in the 16th century ",
      "content": "",
      "url": "https://www.reddit.com/r/BangladeshPolitics/comments/1f9vgnv/britain_was_poor_and_then_it_learned_how_to_be/",
      "score": 1,
      "comments_count": 0,
      "created_utc": 1725565404.0,
      "author": "OttomanSailor",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_BangladeshPolitics",
      "title": "‘A myopic policy’: India’s backing of ousted Bangladesh leader Sheikh Hasina leaves it in a bind. New Delhi was seen as former PM’s greatest ally. Now it must reckon with a new government that wants accountability for her regime’s actions.",
      "content": "",
      "url": "https://www.reddit.com/r/BangladeshPolitics/comments/1f7nd6m/a_myopic_policy_indias_backing_of_ousted/",
      "score": 1,
      "comments_count": 0,
      "created_utc": 1725325863.0,
      "author": "_II_I_I__I__I_I_II_",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_BangladeshPolitics",
      "title": "Muhammad Yunus Becomes Chief Adviser of Bangladesh!",
      "content": "Big news! Nobel Laureate Muhammad Yunus has been appointed Chief Adviser of Bangladesh’s interim government. With his background in social entrepreneurship, this could be a game-changer for the country.\n\nEven more interesting, UAE President Sheikh Mohamed bin Zayed congratulated Yunus and highlighted the potential for stronger ties between Bangladesh and the UAE. This partnership could unlock new opportunities for both nations.\n\nExcited to see what’s next! What do you think this means for Bangladesh’s future? Let’s talk!",
      "url": "https://www.reddit.com/r/BangladeshPolitics/comments/1f3x9wv/muhammad_yunus_becomes_chief_adviser_of_bangladesh/",
      "score": 1,
      "comments_count": 2,
      "created_utc": 1724919967.0,
      "author": "welovenepal1",
      "flair": null,
      "comments": [
        "I'm excited. Hey, btw I do political commentary specifically on Bangladesh. At the moment, I'm spending a lot of my time endorsing Yunus, actually.\n\nCheck out my Twitter/X: [https://x.com/BengalTigress\\_](https://x.com/BengalTigress_)"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_BangladeshPolitics",
      "title": "This field is required - Google Search",
      "content": "",
      "url": "https://www.reddit.com/r/BangladeshPolitics/comments/1f0en4r/this_field_is_required_google_search/",
      "score": 1,
      "comments_count": 0,
      "created_utc": 1724530895.0,
      "author": "Medical_Language_799",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_BangladeshPolitics",
      "title": "Sheikh Hasina she’s genuinely the mother of humanity and undoubtedly she will be written in history as the best Prime Minister of Bangladesh but Bengalis didn’t knew how to value a woman like her. Pura Bengali jaati kanbe ekdin and regret korbe for stepping her down, mark my words.",
      "content": "",
      "url": "https://www.reddit.com/r/BangladeshPolitics/comments/1f01qmd/sheikh_hasina_shes_genuinely_the_mother_of/",
      "score": 1,
      "comments_count": 2,
      "created_utc": 1724493576.0,
      "author": "tedy_daniels",
      "flair": null,
      "comments": [
        "Sounds like you love and miss her, but she abandoned you. If you miss her, you can always go to India"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_BangladeshPolitics",
      "title": "In Bangladesh, protests against a quota system for government jobs turned into a broad uprising forcing the prime minister into exile & to resign. Students or other young people frequently played pivotal roles in popular uprisings that have brought down governments or forced them to change policies.",
      "content": "",
      "url": "https://www.reddit.com/r/BangladeshPolitics/comments/1eqelmn/in_bangladesh_protests_against_a_quota_system_for/",
      "score": 4,
      "comments_count": 1,
      "created_utc": 1723471468.0,
      "author": "_II_I_I__I__I_I_II_",
      "flair": null,
      "comments": [
        "change is needed"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_BangladeshPolitics",
      "title": "CCTV footage shows vandalism & petrol bomb attack on the Bangladesh Islamic Centre in Newtownards, Northern Ireland. The founder Abdul Rob spoke with Allan Preston from The Irish News.",
      "content": "",
      "url": "https://www.reddit.com/r/BangladeshPolitics/comments/1ephru7/cctv_footage_shows_vandalism_petrol_bomb_attack/",
      "score": 2,
      "comments_count": 0,
      "created_utc": 1723372573.0,
      "author": "_II_I_I__I__I_I_II_",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_BUET",
      "title": "Hi guys, I'm new here. I have a question- are the questions asked in English for english medium students?",
      "content": "",
      "url": "https://www.reddit.com/r/BUET/comments/vtq0y8/hi_guys_im_new_here_i_have_a_question_are_the/",
      "score": 5,
      "comments_count": 1,
      "created_utc": 1657220051.0,
      "author": "ImprovementFun8632",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_BUET",
      "title": "Can I get a degree in pure physics from BUET",
      "content": "",
      "url": "https://www.reddit.com/r/BUET/comments/v40n65/can_i_get_a_degree_in_pure_physics_from_buet/",
      "score": 2,
      "comments_count": 2,
      "created_utc": 1654266539.0,
      "author": "Cheap-Public8837",
      "flair": null,
      "comments": [
        "Do you mean M.Sc?"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_BUET",
      "title": "What's Buet's biggest pros and cons?",
      "content": "Hi. I got into Buet and also an university in Malaysia. I've been on this decision for quite a while with a big list of pros and cons but I'm not sure which are facts and which are not. So i wanna do a crosscheck.",
      "url": "https://www.reddit.com/r/BUET/comments/rd5mcw/whats_buets_biggest_pros_and_cons/",
      "score": 3,
      "comments_count": 7,
      "created_utc": 1639131374.0,
      "author": "Peculio_9104",
      "flair": null,
      "comments": [
        "Where are you now? It has been 3yrs",
        "Are you Bangladeshi?",
        "How did u got admitted in malasiya University?"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_BUET",
      "title": "Placement and Package of CSE department in BUET",
      "content": "does undegrads from the CSE department get direct offers to work with the big software techs in the US?",
      "url": "https://www.reddit.com/r/BUET/comments/nnnc13/placement_and_package_of_cse_department_in_buet/",
      "score": 1,
      "comments_count": 2,
      "created_utc": 1622294348.0,
      "author": "caramelsn01",
      "flair": null,
      "comments": [
        "some of them do, not because they are from buet cse but because they are highly eligible :)",
        "if you want any kind of high paying job in the US after BUET that’s not entrepreneurial, you must get a masters or PhD from the US"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_BUET",
      "title": "Satya Prasad Majumder named new VC of BUET",
      "content": "",
      "url": "https://www.reddit.com/r/BUET/comments/hfksr5/satya_prasad_majumder_named_new_vc_of_buet/",
      "score": 5,
      "comments_count": 5,
      "created_utc": 1593086172.0,
      "author": "bogurar_chhol",
      "flair": null,
      "comments": [
        "The father of amit shah?",
        "Always be afraid of hindus being in positions of power. You can’t trust them."
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_BUET",
      "title": "help!",
      "content": "what score is 'safe' to place in top 200? \n\nand, I'm a bit torn between cse/eee in buet and nuclear engg./robotics/physics in DU...  any advice is appreciated",
      "url": "https://www.reddit.com/r/BUET/comments/c7n7qb/help/",
      "score": 4,
      "comments_count": 18,
      "created_utc": 1561949755.0,
      "author": "reraidiot28",
      "flair": null,
      "comments": [
        " \n\nscore is highly subjective to how difficult the admission test is, and how your peer group is performing on the admission test.\n\nMajor  choice should be dependent on your own personal interest and career  goal. Applied physics of DU and EEE in BUET both have similar syllabus,  but EEE BUET currently has highest number of PhDs from North America. So  if you are interested in research or academia, EEE BUET is your safest  bet. There are some faculty members who work on Robotics as well in EEE.  If you are more interested in Programming and math problem, BUET CSE  would work best for you.  They are exceptionally strong in Algorithm  research.\n\nFor Nuclear Engineering, unfortunately, DU does not have sufficient number of faculty members having PhD ([https://www.du.ac.bd/academic/department\\_item\\_details/faculty/NED](https://www.du.ac.bd/academic/department_item_details/faculty/NED)). Consider an Undergrad in mechanical engineering or electrical engineering, and then get a Master's from abroad.",
        "Don't get your question. BUET and DU has separate admission tests.",
        "Ooh, it's been 6 years, what did you get into?"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_NSU",
      "title": "best departments ki nsu teh",
      "content": "",
      "url": "https://www.reddit.com/r/NSU/comments/1hja4yp/best_departments_ki_nsu_teh/",
      "score": 1,
      "comments_count": 1,
      "created_utc": 1734788762.0,
      "author": "zahishowkat",
      "flair": null,
      "comments": [
        "Worst department is whoever is in charge of posting the fucking radio station phone number. Cuz it’s not on the website, fb, or radio directories."
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_NSU",
      "title": "Searching for an Oboist",
      "content": "I couldn’t find a subreddit related to the NSU band so I was wondering if someone, preferably in the band, knows of an oboe player who sells reeds or would be willing to do private lessons teaching oboe ",
      "url": "https://www.reddit.com/r/NSU/comments/1gwr5gd/searching_for_an_oboist/",
      "score": 3,
      "comments_count": 0,
      "created_utc": 1732225277.0,
      "author": "CommieZalio",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_NSU",
      "title": "[PSA] The deadline to register to vote online is 1 WEEK from now, OCT 15th!",
      "content": "",
      "url": "https://www.reddit.com/r/NSU/comments/1fz19l1/psa_the_deadline_to_register_to_vote_online_is_1/",
      "score": 2,
      "comments_count": 0,
      "created_utc": 1728398045.0,
      "author": "papergabby",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_NSU",
      "title": "Master of Science in Community/Technical College Mathematics",
      "content": "Hey, everyone! I am a engineering grad from a Pakistani university with a 2.99 CGPA on a 4.0 scale. I was thinking about applying for this program and I was hoping if anyone on  this subreddit could shed some light upon whether it could be a suitable fit for someone like me to apply to, and if it is STEM-designated. I would appreicate any information anyone here could provide in this regard. Thank you so much!\n\n[Master of Science in Community/Technical College Mathematics - Catalog 2019-2020 (nicholls.edu)](https://www.nicholls.edu/catalog-2019-2020/graduate_studies/sciences-and-technology/ms-in-community_technical-college-mathematics/) ",
      "url": "https://www.reddit.com/r/NSU/comments/16ym9n4/master_of_science_in_communitytechnical_college/",
      "score": 2,
      "comments_count": 0,
      "created_utc": 1696321736.0,
      "author": "Separate_Part_7709",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_NSU",
      "title": "Master of Science in Community/Technical College Mathematics",
      "content": "Hey, everyone! I am a engineering grad from a Pakistani university with a 2.99 CGPA on a 4.0 scale. I was thinking about applying for this program and I was hoping if anyone on  this subreddit could shed some light upon whether it could be a suitable fit for someone like me to apply to, and if it is STEM-designated. I would appreicate any information anyone here could provide in this regard. Thank you so much!\n\n[Master of Science in Community/Technical College Mathematics - Catalog 2019-2020 (nicholls.edu)](https://www.nicholls.edu/catalog-2019-2020/graduate_studies/sciences-and-technology/ms-in-community_technical-college-mathematics/) ",
      "url": "https://www.reddit.com/r/NSU/comments/16ym9mc/master_of_science_in_communitytechnical_college/",
      "score": 1,
      "comments_count": 0,
      "created_utc": 1696321734.0,
      "author": "Separate_Part_7709",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_NSU",
      "title": "Anyone else struggling with loneliness?",
      "content": "Hey to anyone who is a nicholls student and struggling to find friends. And sorry for this kind of depressing post. Just wondering if anyone is struggling this year with loneliness. It seems impossible to make friends.",
      "url": "https://www.reddit.com/r/NSU/comments/rc81lb/anyone_else_struggling_with_loneliness/",
      "score": 6,
      "comments_count": 4,
      "created_utc": 1639018878.0,
      "author": "[deleted]",
      "flair": null,
      "comments": [
        "Yo you doing ok?",
        "Did you try joining one of the clubs?"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_NSU",
      "title": "Hello! Potential colonel here, in need of a little assistance.",
      "content": "I'm an international student and I'm hoping to start my ug at NSU next fall. I'm having a really hard time trying to find what clothes to take. Can anyone tell me what kinda clothing I need to pack for every season in Thibodaux, LA? Thanks!",
      "url": "https://www.reddit.com/r/NSU/comments/qsz4cq/hello_potential_colonel_here_in_need_of_a_little/",
      "score": 1,
      "comments_count": 4,
      "created_utc": 1636801792.0,
      "author": "ranishkromodoyo",
      "flair": null,
      "comments": [
        "Pack for warmer temperatures most of the year. Shorts, t shirts, polos, hat and sunglasses should cover you. It does get chilly in the winter too but not really cold enough for gloves and insulated underwear so maybe bring along a hoodie and a jacket too. If you need clothes there's also a wal-mart close to campus that you could get stuff from."
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_NSU",
      "title": "I made some studying playlists if any of you need something to study to! ;)",
      "content": "Lofi: [https://open.spotify.com/playlist/4O6nbjrBCV5oWNi6WMIymM?si=LxP1bpGZSBOZylcD-w2mIA](https://open.spotify.com/playlist/4O6nbjrBCV5oWNi6WMIymM?si=LxP1bpGZSBOZylcD-w2mIA)\n\nBlonded Radio (for Frank fans): [https://open.spotify.com/playlist/4xBki2iZiFmPbHZQDOjnOm?si=uFSPKMaxR4qM2g0oJWOnvw](https://open.spotify.com/playlist/4xBki2iZiFmPbHZQDOjnOm?si=uFSPKMaxR4qM2g0oJWOnvw)\n\nAlternative RnB: [https://open.spotify.com/playlist/4WtH4XOiIOmHeLkIMTiDp4?si=FKwkM4T1TL6AlZ1zV-3lZQ](https://open.spotify.com/playlist/4WtH4XOiIOmHeLkIMTiDp4?si=FKwkM4T1TL6AlZ1zV-3lZQ)\n\nLate Night Drives (bonus one for the vibers): [https://open.spotify.com/playlist/3wITot3JZ9XjcrtkyIdlBj?si=NBHPEo3QSvm\\_fRec6T9-Eg](https://open.spotify.com/playlist/3wITot3JZ9XjcrtkyIdlBj?si=NBHPEo3QSvm_fRec6T9-Eg)",
      "url": "https://www.reddit.com/r/NSU/comments/m7ihkj/i_made_some_studying_playlists_if_any_of_you_need/",
      "score": 2,
      "comments_count": 0,
      "created_utc": 1616039649.0,
      "author": "ADRIANREY4",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_NSU",
      "title": "Drivers wanted - New student ridesharing app soon to do beta testing",
      "content": "Hey everybody!\n\nI work with a small startup at MIT, focused on intercity mobility called Loop: [https://www.loop-ridesharing.com](https://www.loop-ridesharing.com/)\n\nWe’re attempting to reimagine the future of post-CoVID transportation between American cities, creating safe spaces for students to rideshare between college campuses and home. We will be releasing beta tests in the coming weeks. If you have a student email address, own a driver's license, and are interested in sharing your ride for a bit of cash in return, sign up for our beta testing here:\n\n[https://docs.google.com/forms/d/1gw-VVkt1nb7AX-ClIBS0y\\_v8FkVOFonlxf39\\_hZpC8A/viewform?edit\\_requested=true](https://docs.google.com/forms/d/1gw-VVkt1nb7AX-ClIBS0y_v8FkVOFonlxf39_hZpC8A/viewform?edit_requested=true)\n\nJon",
      "url": "https://www.reddit.com/r/NSU/comments/ljz3iu/drivers_wanted_new_student_ridesharing_app_soon/",
      "score": 2,
      "comments_count": 0,
      "created_utc": 1613341946.0,
      "author": "ThePoint1980",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_NSU",
      "title": "J Clune",
      "content": "",
      "url": "https://www.reddit.com/r/NSU/comments/ixyuey/j_clune/",
      "score": 3,
      "comments_count": 2,
      "created_utc": 1600817362.0,
      "author": "GreenGrab",
      "flair": null,
      "comments": [
        "We need to get this subreddit alive again."
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_NSU",
      "title": "I am here",
      "content": "Hello and good evening Colonel Family. I, the Clunemeister, have arrived at r/NSU and am happy to announce that COVID will never destroy our spirit. Geaux Colonels!",
      "url": "https://www.reddit.com/r/NSU/comments/i6c60w/i_am_here/",
      "score": 3,
      "comments_count": 1,
      "created_utc": 1596941844.0,
      "author": "[deleted]",
      "flair": null,
      "comments": [
        "Hell yeah brother clune is a  good president for Nicholls"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_NSU",
      "title": "Nvm I dropped the 🅱️izza 😢",
      "content": "I'm gonna die",
      "url": "https://www.reddit.com/r/NSU/comments/i6bv1o/nvm_i_dropped_the_izza/",
      "score": 3,
      "comments_count": 2,
      "created_utc": 1596940476.0,
      "author": "Baysidellama3",
      "flair": null,
      "comments": [
        "HEART ❤️ BEEN✌🏾BROKE💔SO MANY ✊🏾 TIMES🕑 I-I-i",
        "that's cringe bro"
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_NSU",
      "title": "Need materials for class! help",
      "content": "Hello fellow Redditors I'm a freshman here and I am looking to purchase a COVID hazmat suit for my classes. If anyone has a leftover one from a previous class, please let me know",
      "url": "https://www.reddit.com/r/NSU/comments/i6btyr/need_materials_for_class_help/",
      "score": 2,
      "comments_count": 1,
      "created_utc": 1596940352.0,
      "author": "GreenGrab",
      "flair": null,
      "comments": [
        "I only have my old radiation protection gear with built-in Geiger counter.  Totally old-school and a fashion statement bar-none, to say the least.  A couple of adjustments should make it Covid-proof and you’ll have the ability to survive small-scale nuclear attacks too."
      ],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_NSU",
      "title": "Come get urrrr free pizza colonel gamers!!!!!🤤",
      "content": "",
      "url": "https://www.reddit.com/r/NSU/comments/i6btmw/come_get_urrrr_free_pizza_colonel_gamers/",
      "score": 2,
      "comments_count": 1,
      "created_utc": 1596940310.0,
      "author": "Baysidellama3",
      "flair": null,
      "comments": [],
      "scraped_date": "2025-06-24"
    },
    {
      "source": "reddit_r_NSU",
      "title": "This is a social experiment",
      "content": "",
      "url": "https://www.reddit.com/r/NSU/comments/fcpls8/this_is_a_social_experiment/",
      "score": 6,
      "comments_count": 3,
      "created_utc": 1583211805.0,
      "author": "GreenGrab",
      "flair": null,
      "comments": [
        "Take my silver"
      ],
      "scraped_date": "2025-06-24"
    }
  ]
}